Ran Plan for project: `homelab-kubernetes-fleet` dir: `repositories/homelab-kubernetes-fleet` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.github_repository.github_repository.repo: Refreshing state... [id=homelab-kubernetes-fleet]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repository.github_repository.repo has been deleted
- resource "github_repository" "repo" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
        ] -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Flux repo for Kubernetes homelab" -> null
      - etag                   = "W/\"ca5ba3022722f2a500e735494cba06bcae581fe0218f5fe8e1532055be1f2419\"" -> null
      - full_name              = "glitchcrab/homelab-kubernetes-fleet" -> null
      - git_clone_url          = "git://github.com/glitchcrab/homelab-kubernetes-fleet.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/glitchcrab/homelab-kubernetes-fleet" -> null
      - http_clone_url         = "https://github.com/glitchcrab/homelab-kubernetes-fleet.git" -> null
      - id                     = "homelab-kubernetes-fleet" -> null
      - is_template            = false -> null
      - name                   = "homelab-kubernetes-fleet" -> null
      - node_id                = "R_kgDOGaqoaA" -> null
      - private                = true -> null
      - repo_id                = 430614632 -> null
      - ssh_clone_url          = "git@github.com:glitchcrab/homelab-kubernetes-fleet.git" -> null
      - svn_url                = "https://github.com/glitchcrab/homelab-kubernetes-fleet" -> null
      - topics                 = [
          - "automation",
          - "continuous-deployment",
          - "kubernetes",
        ] -> null
      - visibility             = "private" -> null
      - vulnerability_alerts   = false -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Flux repo for Kubernetes homelab"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "homelab-kubernetes-fleet"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "automation",
          + "continuous-deployment",
          + "kubernetes",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p homelab-kubernetes-fleet`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=glitchcrab%252Fgithub-repo-management%252Frepositories%252Fhomelab-kubernetes-fleet%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p homelab-kubernetes-fleet`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
